#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция МассовоеСозданиеРеализацийУслуг(Договоры, Дата) Экспорт

	ВсегоДоговоров = Договоры.Количество();
	Счет = 0;
	
	Для Каждого Договор Из Договоры Цикл
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = Дата;
		НовыйДокумент.Организация = Договор.Организация;
		НовыйДокумент.Контрагент = Договор.Контрагент;
		НовыйДокумент.Договор = Договор.Ссылка;
		НовыйДокумент.Комментарий = "Документ создан обработкой ""Массовое создание актов""";
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		
		НовыйДокумент.ВыполнитьАвтозаполнение();
		
		Если НовыйДокумент.Услуги.Количество() <> 0 Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Счет = Счет + 1;
		ДлительныеОперации.СообщитьПрогресс(Счет/ВсегоДоговоров * 100);
	КонецЦикла;
	
	Возврат "Документы готовы";    
	
КонецФункции

#КонецОбласти

#КонецЕсли