
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();   
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	
	СформироватьДвиженияНачисленияПремии();	
	СформироватьДвиженияУдержания();
	СформироватьДвиженияВзаиморасчетыССотрудниками();
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура СформироватьДвиженияНачисленияПремии();
		
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл    
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Результат = Строка.СуммаПремии;
		Движение.Размер = Строка.СуммаПремии;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура СформироватьДвиженияУдержания();
	
	Движения.ВКМ_Удержания.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл    
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Результат = Строка.СуммаПремии/100*13;
		Движение.Размер = Строка.СуммаПремии;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура СформироватьДвиженияВзаиморасчетыССотрудниками();
		
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		СуммаУдержания = Строка.СуммаПремии/100*13;
		Движение.Сумма = Строка.СуммаПремии - СуммаУдержания;
	КонецЦикла;
    	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
