#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	    	
	ДанныеДокумента = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	ОтпускаСотрудников = ДанныеДокумента["ОтпускаСотрудников"];
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Вставить(0); 
	Шкала.Метки.Очистить();
	
	МеткаВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДатаСеанса()));
	МеткаВремени.Текст = "Текущая дата " + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	МеткаВремени.ЦветТекста = WebЦвета.Красный;				
	МеткаВремени.ЦветЛинии = WebЦвета.Красный;
	
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл  
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;	
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
