#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)   
	
	Ответственный = Пользователи.ТекущийПользователь();   
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ГрафикОтпусков
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;  
		
		КоличествоСекунд = НачалоДня(Движение.ДатаОкончания) - НачалоДня(Движение.ДатаНачала); 
		
		Движение.КоличествоДней = КоличествоСекунд / (60 * 60 * 24); 
		
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	ВыбранныйГод = НачалоГода(Год); 
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если ВыбранныйГод <> НачалоГода(Строка.ДатаНачала) Тогда
			Сообщение = "Год ""Даты начала"" должен быть таким же как указано в реквизите документа ""Год""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаНачала");
			Отказ = Истина;
		КонецЕсли;
		
		Если ВыбранныйГод <> НачалоГода(Строка.ДатаОкончания) Тогда
			Сообщение = "Год ""Даты окончания"" должен быть таким же как указано в реквизите документа ""Год""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
		
		Если  ((НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / 86400 + 1) <= 1 Тогда
			Сообщение = "Значение поля ""Дата окончания"" должно быть больше значению поля ""Дата начала""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
