#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 

	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"),ЭтотОбъект);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Если Элементы.Найти("ПериодДействияС") = Неопределено Тогда 
		НовыйЭлемент = Элементы.Добавить("ПериодДействияС", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ПериодДействияС";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Период действия с";
	КонецЕсли;  
	
	Если Элементы.Найти("ПериодДействияПо") = Неопределено Тогда 
		НовыйЭлемент = Элементы.Добавить("ПериодДействияПо", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ПериодДействияПо";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "по";
	КонецЕсли;  
	
	Если Элементы.Найти("СуммаАбонентскойПлаты") = Неопределено Тогда 
		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Сумма абонентской платы";
	КонецЕсли;     
	
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда 
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы";
	КонецЕсли; 
			
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении"); 
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);    
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВКМ_ПериодДействияПо < Объект.ВКМ_ПериодДействияС Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата окончания не может быть меньше даты начала действия договора!";
		Сообщение.Поле = "Объект.ВКМ_ПериодДействияПо";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент) 
	
	ВывестиЭлементыНаФорму(ЭтотОбъект); 
	
КонецПроцедуры     

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиЭлементыНаФорму(Форма) 
	
	Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда 
		Форма.Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
		Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		Форма.Элементы.ПериодДействияС.Видимость = Истина;
		Форма.Элементы.ПериодДействияПо.Видимость = Истина;
	Иначе 
		Форма.Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
		Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		Форма.Элементы.ПериодДействияС.Видимость = Ложь;
		Форма.Элементы.ПериодДействияПо.Видимость = Ложь;
	КонецЕсли;
			
КонецПроцедуры

