#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();    
	
	Объект.Выплаты.Очистить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			Строка = Объект.Выплаты.Добавить(); 
			Строка.Сотрудник = Выборка.Сотрудник;  
			Строка.Сумма = Выборка.Сумма; 
			
		КонецЦикла;  
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Начисления отсутствуют!");
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти
